# language: ru

  Функциональность: Презентация приимуществ национальной сеть сэндвич-шопов для пользователей и потенциальных партнеров
    Чтобы посетители понимали ценность сети и возможности сотружничества
    Как новый пользователь или потенциальный партнер
    Я хочу увидеть ключевые преимущества сервиса и информации о сотрудничестве на стартовой странице (preauthorize zone)
    Предыстория: Допустим пользователь открывает стартовую страницу

      Сценарий: Обычный пользователь знакомится с сентю шопов и меню
        Допустим пользователь хочет сделать заказ
        Когда пользователь просматривает стартовую страницу
        Тогда пользователь видит ключевые приемущества сети
        И пользователь видит описание популярных сэндвичей и меню
        И пользователь видит текущие акции и спецпредложения
        И пользователь видит кнопку "Зарегистрироваться"

      Сценарий: Потенциальный партнёр узнаёт о возможностях сотрудничества
        Допустим потенциальный партнёр интересуется франшизой
        Когда потенциальный партнёр стартовую страницу
        Тогда потенциальный партнёр видит преимущества партнерской программы
        И потенциальный партнёр видит информацию о том, как стать партнёром сети
        И пользователь видит кнопку "Стать партнёром" или "Связаться с нами"